NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_flpr.svd
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for APPLICATION.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for APPLICATION.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x34</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_APPLICATION_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for APPLICATION.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>RADIOCORE</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_RADIOCORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x310</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for RADIOCORE.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for RADIOCORE.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x34</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
