NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_flpr.svd
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DETECTMODE</name>
          <description>Select between default DETECT signal behavior and LDETECT mode</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>DETECTMODE</name>
              <description>Select between default DETECT signal behavior and LDETECT mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>DETECT directly connected to PIN DETECT signals</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDETECT</name>
                  <description>Use the latched LDETECT behavior</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PORTCNF</name>
          <description>Unspecified</description>
          <headerStructName>GPIO_PORTCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x030</addressOffset>
          <register>
            <name>DRIVECTRL</name>
            <description>Drive control for impedance matching of the pins in this port</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>IMPEDANCE50</name>
                <description>Enable 50 ohms impedance to the pins in this port</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEDANCE100</name>
                <description>Enable 100 ohms impedance to the pins in this port</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEDANCE200</name>
                <description>Enable 200 ohms impedance to the pins in this port</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEDANCE400</name>
                <description>Enable 400 ohms impedance to the pins in this port</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEDANCE800</name>
                <description>Enable 800 ohms impedance to the pins in this port</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEDANCE1600</name>
                <description>Enable 1600 ohms impedance to the pins in this port</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
